cases/singleDroplet/TuAndRay/system/controlDict
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     aerosolEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         80;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression no;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

maxAerosolCo    0.001;

maxDeltaT       1E-5;

libs            ("libcustomFunctions.so");

functions
{
    dcm
    {
        type            countMeanDiameter;
        libs            ("libaerosolModels.so");
        writeControl    writeTime;
    }
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;
        startTime       2E-6;
        probeLocations
        (
            (0.5E-3 0.5E-3 0.5E-3)
        );
        fields
        (
            "(Air|Water|VG).(continuous|dispersed)"
            M
            "M\.[0-9]+"
            dcm
            rho
        );
    }
}
